trefeon/excavator-rental-timer/firmware/wifi_master_esp32_nonWEBUI/main.cpp
  switch (pkt.type) {
    case PKT_REGISTER_REQ: {
      Serial.printf("[ESPNOW] Registration request from MAC: %s\n", senderMac.c_str());

      int assignedId = 0;
      if (xSemaphoreTake(slavesMutex, MUTEX_TIMEOUT_TICKS) == pdTRUE) {
        assignedId = assignIdForMac(senderMac);
        if (assignedId > 0) {
          upsertSlave(senderMac, assignedId, pkt.mac);
        }
        xSemaphoreGive(slavesMutex);
      }

      // Send registration response
      EspNowPacket resp;
      memset(&resp, 0, sizeof(resp));
      resp.type = PKT_REGISTER_RESP;
      resp.targetId = assignedId;
      resp.senderId = 0; // Master
      memcpy(resp.mac, pkt.mac, 6);

      esp_now_send(ESPNOW_BROADCAST, (uint8_t*)&resp, sizeof(resp));
      Serial.printf("[ESPNOW] Sent registration response: ID=%d to %s\n", assignedId, senderMac.c_str());
      break;
    }

    case PKT_HEARTBEAT: {
      if (xSemaphoreTake(slavesMutex, MUTEX_TIMEOUT_TICKS) == pdTRUE) {
        bool found = false;
        for (int i = 0; i < slaveCount; i++) {
          if (slaves[i].mac == senderMac) {
            found = true;
            String newState = pktStateName(pkt.state);

            // Hitung elapsed: jika sebelumnya RUNNING dan time_left berkurang
            if (slaves[i].state == "RUNNING" && (newState == "RUNNING" || newState == "ENDED" || newState == "PAUSED")) {
              int diff = slaves[i].time_left - (int)pkt.timeLeft;
              if (diff > 0) slaves[i].sessionElapsed += diff;
            }

            // Deteksi transisi ke sesi baru: dari ENDED/LOCKED ke RUNNING
            if ((slaves[i].state == "ENDED" || slaves[i].state == "LOCKED") &&
                newState == "RUNNING") {
              slaves[i].sessionElapsed     = 0; // reset counter sesi baru
              slaves[i].sessionSavedElapsed = 0; // belum ada yang disimpan untuk sesi baru
              slaves[i].lastStatsSaveMs     = millis(); // timer periodik save mulai dari sekarang
            }

            // ── Periodik save selama RUNNING ──────────────────────────────
            // Setiap ~30 detik, simpan delta = (sessionElapsed - sessionSavedElapsed)
            // ke /stats.json. Supaya refresh browser di tengah sesi tidak
            // membuat Total Main kembali ke 00:00.
            if (slaves[i].state == "RUNNING" && newState == "RUNNING") {
              const unsigned long PERIODIC_SAVE_MS = 30000UL;
              unsigned long nowMs = millis();
              if (slaves[i].lastStatsSaveMs == 0 || (nowMs - slaves[i].lastStatsSaveMs) >= PERIODIC_SAVE_MS) {
                int delta = slaves[i].sessionElapsed - slaves[i].sessionSavedElapsed;
                if (delta > 0) {
                  int slaveId = slaves[i].id;
                  xSemaphoreGive(slavesMutex);
                  autoSaveStats(slaveId, delta, false); // incrementSesi=false
                  if (xSemaphoreTake(slavesMutex, MUTEX_TIMEOUT_TICKS) != pdTRUE) break;
                  // Cari ulang index karena mutex sempat dilepas
                  for (int k = 0; k < slaveCount; k++) {
                    if (slaves[k].mac == senderMac) { i = k; break; }
                  }
                  slaves[i].sessionSavedElapsed = slaves[i].sessionElapsed;
                  slaves[i].lastStatsSaveMs     = nowMs;
                }
              }
            }

            // Deteksi transisi ke ENDED → auto-save stats
            // Skip kalau sudah di-STOP manual (race protection: heartbeat ENDED
            // bisa sampai setelah STOP command set stoppedManually=true).
            if (slaves[i].state != "ENDED" && newState == "ENDED" && !slaves[i].stoppedManually) {
              int delta = slaves[i].sessionElapsed - slaves[i].sessionSavedElapsed;
              int slaveId = slaves[i].id;
              xSemaphoreGive(slavesMutex);
              autoSaveStats(slaveId, delta, true); // sesi selesai alami → increment sesi
              if (xSemaphoreTake(slavesMutex, MUTEX_TIMEOUT_TICKS) != pdTRUE) break;
              // Cari ulang index karena mutex sempat dilepas
              for (int k = 0; k < slaveCount; k++) {
                if (slaves[k].mac == senderMac) { i = k; break; }
              }
              slaves[i].sessionElapsed     = 0;
              slaves[i].sessionSavedElapsed = 0;
              slaves[i].sessionPackageTime = 0;
            }
            slaves[i].stoppedManually = false; // reset after ENDED processed (or no ENDED)

            slaves[i].prevState  = slaves[i].state;
            slaves[i].state      = newState;
            slaves[i].time_left  = pkt.timeLeft;
            slaves[i].battery    = "OK";
            slaves[i].lastSeen   = millis();

            // Check if slave's ID is out of sync (e.g., after edit_slave)
            if (pkt.senderId != (uint8_t)slaves[i].id) {
              Serial.printf("[ESPNOW] Slave %s has stale ID %d, correcting to %d\n",
                            senderMac.c_str(), pkt.senderId, slaves[i].id);
              // Send correction
              EspNowPacket corr;
              memset(&corr, 0, sizeof(corr));
              corr.type = PKT_REGISTER_RESP;
              corr.targetId = slaves[i].id;
              memcpy(corr.mac, pkt.mac, 6);
              esp_now_send(ESPNOW_BROADCAST, (uint8_t*)&corr, sizeof(corr));
            }
            break;
          }
        }

        // Unknown MAC sending heartbeats — auto-register from Preferences
        // This handles Master reboot: slave is still heartbeating but Master
        // lost its in-memory array. The Preferences (flash) still has the MAC→ID mapping.
        if (!found) {
          Serial.printf("[ESPNOW] Heartbeat from unknown MAC %s — auto-registering\n", senderMac.c_str());
          int assignedId = assignIdForMac(senderMac);
          if (assignedId > 0) {
            upsertSlave(senderMac, assignedId, pkt.mac);
            // Update state from heartbeat data
            for (int i = 0; i < slaveCount; i++) {
              if (slaves[i].mac == senderMac) {
                slaves[i].state = pktStateName(pkt.state);
                slaves[i].time_left = pkt.timeLeft;
                slaves[i].lastSeen = millis();
                break;
              }
            }
            // Send registration response so slave knows it's recognized
            EspNowPacket resp;
            memset(&resp, 0, sizeof(resp));
            resp.type = PKT_REGISTER_RESP;
            resp.targetId = assignedId;
            memcpy(resp.mac, pkt.mac, 6);
            esp_now_send(ESPNOW_BROADCAST, (uint8_t*)&resp, sizeof(resp));
          }
        }

        xSemaphoreGive(slavesMutex);
      }
      break;
    }

