trefeon/excavator-rental-timer/firmware/wifi_master_esp32_nonWEBUI/main.cpp
    case PKT_COMMAND_RESP: {
      // Store the response and signal the waiting HTTP handler
      portENTER_CRITICAL(&cmdResponseMux);
      memcpy(&cmdResponsePkt, &pkt, sizeof(pkt));
      cmdResponseReceived = true;
      portEXIT_CRITICAL(&cmdResponseMux);

      if (cmdResponseSem) {
        xSemaphoreGive(cmdResponseSem);
      }

      // Also update the slave cache
      if (xSemaphoreTake(slavesMutex, MUTEX_TIMEOUT_TICKS) == pdTRUE) {
        for (int i = 0; i < slaveCount; i++) {
          if (slaves[i].mac == senderMac) {
            slaves[i].state = pktStateName(pkt.state);
            slaves[i].time_left = pkt.timeLeft;
            slaves[i].lastSeen = millis();
            break;
          }
        }
        xSemaphoreGive(slavesMutex);
      }
      break;
    }

    default:
      Serial.printf("[ESPNOW] Unknown packet type: %d\n", pkt.type);
      break;
  }
}

// ===== AUTO-SAVE STATS =====
// Dipanggil saat sesi RC selesai (time_left habis) atau periodik setiap ~30s
// selama sesi berjalan, sehingga /stats.json selalu up-to-date. Incremental:
// detik adalah DELTA dari save terakhir, bukan elapsed total.
//
// incrementSesi=true  → sesi selesai alami (totalDetik += detik, totalSesi += 1)
// incrementSesi=false → periodik save / STOP path (hanya totalDetik)
void autoSaveStats(int slaveId, int detik, bool incrementSesi) {
  if (detik == 0 && !incrementSesi) return; // tidak ada yang perlu disimpan
  JsonDocument stats = loadJsonFile("/stats.json");
  String id = String(slaveId);
  if (stats[id].isNull()) {
    stats[id]["totalDetik"] = 0;
    stats[id]["totalSesi"]  = 0;
  }
  if (detik != 0) {
    stats[id]["totalDetik"] = stats[id]["totalDetik"].as<int>() + detik;
    if (stats[id]["totalDetik"].as<int>() < 0) stats[id]["totalDetik"] = 0; // clamp (rollback)
  }
  if (incrementSesi) {
    stats[id]["totalSesi"]  = stats[id]["totalSesi"].as<int>() + 1;
  }
  saveJsonFile("/stats.json", stats);
  Serial.printf("[STATS] Save: RC %d %+ds incSesi=%d (total=%ds, sesi=%d)\n",
                slaveId, detik, incrementSesi,
                stats[id]["totalDetik"].as<int>(),
                stats[id]["totalSesi"].as<int>());
}

// ===== LittleFS HELPERS =====
JsonDocument loadJsonFile(const char* path) {
  JsonDocument doc;
  File file = LittleFS.open(path, "r");
  if (!file) return doc;
  deserializeJson(doc, file);
  file.close();
  return doc;
}

void saveJsonFile(const char* path, const JsonDocument& doc) {
  File file = LittleFS.open(path, "w");
  if (!file) return;
  serializeJson(doc, file);
  file.close();
}

bool authCheck(bool requireSA = false) {
  String u = server.header("X-Admin-User");
  String p = server.header("X-Admin-Pass");
  if (u == "" || p == "") return false;

  JsonDocument auth = loadJsonFile("/auth.json");
  
  if (auth["sa"]["user"] == u && auth["sa"]["pass"] == p) {
    return true; // SuperAdmin has access to everything
  }
  
  if (!requireSA) {
    JsonArray kr = auth["kr"].as<JsonArray>();
    for (JsonObject k : kr) {
      if (k["user"] == u && k["pass"] == p) return true;
    }
  }
  
  return false;
}

// ===== HTTP HANDLERS =====

// GET /api/auth — check if SA exists
void handleCheckAuth() {
  addCorsHeaders();
  JsonDocument auth = loadJsonFile("/auth.json");
  bool exists = !auth["sa"]["user"].isNull();
  server.send(200, "application/json", "{\"exists\":" + String(exists ? "true" : "false") + "}");
}

// POST /api/auth/register — register SA (only if not exists)
void handleRegisterSA() {
  addCorsHeaders();
  if (!server.hasArg("plain")) { server.send(400); return; }
  JsonDocument doc; deserializeJson(doc, server.arg("plain"));
  String u = doc["username"] | "";
  String p = doc["password"] | "";
  if (u == "" || p.length() < 4) { server.send(400, "application/json", "{\"ok\":0}"); return; }

  JsonDocument auth = loadJsonFile("/auth.json");
  if (!auth["sa"]["user"].isNull()) {
    server.send(400, "application/json", "{\"ok\":0,\"code\":\"ALREADY_EXISTS\"}"); return;
  }

  auth["sa"]["user"] = u;
  auth["sa"]["pass"] = p;
  if (auth["kr"].isNull()) auth["kr"] = JsonArray();
  saveJsonFile("/auth.json", auth);
  server.send(200, "application/json", "{\"ok\":1}");
}

// POST /api/auth/login — return role
void handleLogin() {
  addCorsHeaders();
  if (!server.hasArg("plain")) { server.send(400); return; }
  JsonDocument doc; deserializeJson(doc, server.arg("plain"));
  String u = doc["username"] | "";
  String p = doc["password"] | "";

  JsonDocument auth = loadJsonFile("/auth.json");
  if (auth["sa"]["user"] == u && auth["sa"]["pass"] == p) {
    server.send(200, "application/json", "{\"ok\":1,\"role\":\"sa\"}"); return;
  }

  JsonArray kr = auth["kr"].as<JsonArray>();
  for (JsonObject k : kr) {
    if (k["user"] == u && k["pass"] == p) {
      server.send(200, "application/json", "{\"ok\":1,\"role\":\"kr\"}"); return;
    }
  }
  server.send(400, "application/json", "{\"ok\":0}");
}

// POST /api/auth/change-pass
void handleChangePass() {
  addCorsHeaders();
  if (!authCheck()) { server.send(401); return; }
  if (!server.hasArg("plain")) { server.send(400); return; }
  JsonDocument doc; deserializeJson(doc, server.arg("plain"));
  String u = doc["username"] | "";
  String oldP = doc["oldPass"] | "";
  String newP = doc["newPass"] | "";

  JsonDocument auth = loadJsonFile("/auth.json");
  if (auth["sa"]["user"] == u && auth["sa"]["pass"] == oldP) {
    auth["sa"]["pass"] = newP;
    saveJsonFile("/auth.json", auth);
    server.send(200, "application/json", "{\"ok\":1}"); return;
  }

  JsonArray kr = auth["kr"].as<JsonArray>();
  for (JsonObject k : kr) {
    if (k["user"] == u && k["pass"] == oldP) {
      k["pass"] = newP;
      saveJsonFile("/auth.json", auth);
      server.send(200, "application/json", "{\"ok\":1}"); return;
    }
  }
  server.send(400, "application/json", "{\"ok\":0}");
}

// GET /api/karyawan
void handleGetKaryawan() {
  addCorsHeaders();
  if (!authCheck(true)) { server.send(401); return; } // SA only
  JsonDocument auth = loadJsonFile("/auth.json");
  JsonDocument res;
  JsonArray resArr = res["karyawan"].to<JsonArray>();
  JsonArray kr = auth["kr"].as<JsonArray>();
  for (JsonObject k : kr) {
    resArr.add(k["user"]);
  }
  String out; serializeJson(res, out);
  server.send(200, "application/json", out);
}

