trefeon/excavator-rental-timer/firmware/wifi_master_esp32_nonWEBUI/main.cpp
  if (!found) {
    Serial.printf("[PROXY] Failed: Slave EXC-%02d not found in registry\n", targetId);
    server.send(404, "application/json", "{\"ok\":0,\"error\":\"Slave not found\"}");
    return;
  }

#if DEMO_MODE
  if (targetMac.startsWith("FF:FF:FF:00:00:") || targetMac.startsWith("EE:EE:EE:00:00:")) {
    if (xSemaphoreTake(slavesMutex, MUTEX_TIMEOUT_TICKS) == pdTRUE) {
      if (cmdEnum == CMD_ADD_TIME) {
        // Sesi baru: reset sessionElapsed jika sebelumnya ENDED/LOCKED
        if (slaves[slaveIdx].state == "LOCKED" || slaves[slaveIdx].state == "ENDED") {
          slaves[slaveIdx].sessionElapsed = 0;
          slaves[slaveIdx].state = "RUNNING";
        }
        slaves[slaveIdx].time_left += time;
      } else if (cmdEnum == CMD_PAUSE) {
        slaves[slaveIdx].state = "PAUSED";
      } else if (cmdEnum == CMD_RESUME) {
        if (slaves[slaveIdx].time_left > 0) {
          slaves[slaveIdx].state = "RUNNING";
        }
      } else if (cmdEnum == CMD_STOP) {
        // Simpan elapsed sebelum di-reset
        int elapsed = slaves[slaveIdx].sessionElapsed;
        int slaveId  = slaves[slaveIdx].id;
        slaves[slaveIdx].state = "ENDED";
        slaves[slaveIdx].time_left = 0;
        slaves[slaveIdx].sessionElapsed = 0;
        char resp[128];
        snprintf(resp, sizeof(resp), "{\"ok\":1,\"code\":\"SUCCESS\",\"time_left\":0,\"state\":\"ENDED\"}");
        server.send(200, "application/json", String(resp));
        xSemaphoreGive(slavesMutex);
        autoSaveStats(slaveId, elapsed, true); // simpan di luar mutex (DEMO_MODE natural END)
        return;
      }
      slaves[slaveIdx].lastSeen = millis();
      char resp[128];
      snprintf(resp, sizeof(resp), "{\"ok\":1,\"code\":\"SUCCESS\",\"time_left\":%d,\"state\":\"%s\"}", slaves[slaveIdx].time_left, slaves[slaveIdx].state.c_str());
      server.send(200, "application/json", String(resp));
      xSemaphoreGive(slavesMutex);
    } else {
      server.send(503, "application/json", "{\"ok\":0,\"error\":\"Mutex timeout\"}");
    }
    return;
  }
#endif

  // Build ESP-NOW command packet
  EspNowPacket pkt;
  memset(&pkt, 0, sizeof(pkt));
  pkt.type = PKT_COMMAND;
  pkt.targetId = targetId;
  pkt.senderId = 0; // Master
  pkt.cmd = cmdEnum;
  pkt.value = time;

  // Jika manual STOP, hapus sessionElapsed supaya tidak masuk laporan Master (autoSaveStats)
  if (cmdEnum == CMD_STOP) {
    if (xSemaphoreTake(slavesMutex, MUTEX_TIMEOUT_TICKS) == pdTRUE) {
      if (slaveIdx >= 0 && slaveIdx < slaveCount) {
        slaves[slaveIdx].sessionElapsed = 0;
        slaves[slaveIdx].time_left = 0;
      }
      xSemaphoreGive(slavesMutex);
    }
  }

  // Consume any stray semaphore gives
  xSemaphoreTake(cmdResponseSem, 0);

  // Reset response state
  portENTER_CRITICAL(&cmdResponseMux);
  cmdResponseReceived = false;
  portEXIT_CRITICAL(&cmdResponseMux);

  // Broadcast the command
  esp_err_t result = esp_now_send(ESPNOW_BROADCAST, (uint8_t*)&pkt, sizeof(pkt));
  if (result != ESP_OK) {
    Serial.printf("[PROXY] ESP-NOW send failed: %d\n", result);
    server.send(502, "application/json", "{\"ok\":0,\"error\":\"Radio send failed\"}");
    return;
  }

  // Wait for response from slave
  bool gotResponse = false;
  if (xSemaphoreTake(cmdResponseSem, pdMS_TO_TICKS(CMD_RESPONSE_TIMEOUT_MS)) == pdTRUE) {
    portENTER_CRITICAL(&cmdResponseMux);
    gotResponse = cmdResponseReceived;
    portEXIT_CRITICAL(&cmdResponseMux);
  }

  if (gotResponse && cmdResponsePkt.senderId == (uint8_t)targetId) {
    // Build JSON response matching the API spec exactly.
    // BUGFIX: the respCode cast was comparing a uint8_t (respCode) against
    // RespCode enum values via == on a uint8_t variable. RESP_OK=0, RESP_REBOOTING=6
    // so the existing check worked by luck; relying on the same enum value
    // representation in the response struct (which is packed) is unsafe if
    // someone adds a new RespCode. Cast explicitly to RespCode.
    RespCode actualCode = (RespCode)cmdResponsePkt.respCode;
    int ok = (actualCode == RESP_OK || actualCode == RESP_REBOOTING) ? 1 : 0;

    // For ADD_TIME: track sessionPackageTime + reset sessionSavedElapsed for new session
    if (ok && cmdEnum == CMD_ADD_TIME) {
      if (xSemaphoreTake(slavesMutex, MUTEX_TIMEOUT_TICKS) == pdTRUE) {
        for (int i = 0; i < slaveCount; i++) {
          if (slaves[i].id == targetId) {
            if (slaves[i].state == "LOCKED" || slaves[i].state == "ENDED") {
              slaves[i].sessionPackageTime = time;
              slaves[i].sessionSavedElapsed = 0;
              slaves[i].stoppedManually = false;
            } else {
              slaves[i].sessionPackageTime += time;
            }
            break;
          }
        }
        xSemaphoreGive(slavesMutex);
      }
    }

    // For manual STOP: clear sessionPackageTime + set stoppedManually (prevents heartbeat ENDED auto-save)
    if (ok && cmdEnum == CMD_STOP) {
      if (xSemaphoreTake(slavesMutex, MUTEX_TIMEOUT_TICKS) == pdTRUE) {
        for (int i = 0; i < slaveCount; i++) {
          if (slaves[i].id == targetId) {
            slaves[i].sessionPackageTime = 0;
            slaves[i].sessionSavedElapsed = 0;
            slaves[i].stoppedManually = true;
            break;
          }
        }
        xSemaphoreGive(slavesMutex);
      }
    }

    char resp[160];
    snprintf(resp, sizeof(resp),
             "{\"ok\":%d,\"code\":\"%s\",\"time_left\":%lu,\"state\":\"%s\"}",
             ok,
             respCodeName(cmdResponsePkt.respCode),
             (unsigned long)cmdResponsePkt.timeLeft,
             pktStateName(cmdResponsePkt.state));
    Serial.printf("[PROXY] Slave responded: %s\n", resp);
    server.send(200, "application/json", String(resp));
  } else if (gotResponse && cmdResponsePkt.senderId != (uint8_t)targetId) {
    // A different slave replied (stale response, or a slave with a wrong
    // target ID). Don't claim success — the targeted slave didn't ack.
    Serial.printf("[PROXY] Stale ESP-NOW response: senderId=%d != targetId=%d\n",
                  cmdResponsePkt.senderId, targetId);
    server.send(502, "application/json", "{\"ok\":0,\"error\":\"Stale slave response\"}");
  } else {
    Serial.printf("[PROXY] Slave EXC-%02d timeout (no ESP-NOW response)\n", targetId);
    server.send(502, "application/json", "{\"ok\":0,\"error\":\"Slave offline/timeout\"}");
  }
}

// POST /api/edit_slave — Change slave ID (unchanged logic)
void handleEditSlave() {
  addCorsHeaders();
  if (!authCheck(true)) { server.send(401); return; } // SA only
  if (!server.hasArg("plain")) {
    server.send(400);
    return;
  }
  String body = server.arg("plain");

  JsonDocument doc;
  if (deserializeJson(doc, body)) {
    server.send(400, "application/json", "{\"ok\":0}");
    return;
  }
  String mac = doc["mac"] | "";
  int newId = doc["id"] | 0;

  if (mac == "" || !isValidMac(mac) || newId <= 0) {
    Serial.println("[MANAGE] Edit ID failed: Invalid MAC or ID");
    server.send(400, "application/json", "{\"ok\":0}");
    return;
  }

