trefeon/excavator-rental-timer/firmware/wifi_master_esp32_nonWEBUI/main.cpp
#if DEMO_MODE
  if (xSemaphoreTake(slavesMutex, MUTEX_TIMEOUT_TICKS) == pdTRUE) {
    uint8_t fakeRaws[5][6] = {
      {0xFF, 0xFF, 0xFF, 0x00, 0x00, 0x01},
      {0xFF, 0xFF, 0xFF, 0x00, 0x00, 0x02},
      {0xFF, 0xFF, 0xFF, 0x00, 0x00, 0x03},
      {0xEE, 0xEE, 0xEE, 0x00, 0x00, 0x04},
      {0xEE, 0xEE, 0xEE, 0x00, 0x00, 0x05}
    };
    String fakeMacs[5] = {
      "FF:FF:FF:00:00:01", "FF:FF:FF:00:00:02", "FF:FF:FF:00:00:03",
      "EE:EE:EE:00:00:04", "EE:EE:EE:00:00:05"
    };
    String fakeStates[5] = {"ENDED", "ENDED", "ENDED", "ENDED", "ENDED"};
    int fakeTimes[5] = {0, 0, 0, 0, 0};

    for (int i = 0; i < 5; i++) {
      int assignedId = assignIdForMac(fakeMacs[i]);
      if (assignedId > 0) {
        upsertSlave(fakeMacs[i], assignedId, fakeRaws[i]);
        for(int j = 0; j < slaveCount; j++) {
          if(slaves[j].mac == fakeMacs[i]) {
            slaves[j].state = fakeStates[i];
            slaves[j].time_left = fakeTimes[i];
            // If offline demo unit, reset lastSeen so it instantly shows offline
            if (fakeMacs[i].startsWith("EE:")) {
              slaves[j].lastSeen = 0;
            }
          }
        }
      }
    }
    xSemaphoreGive(slavesMutex);
    Serial.println("[DEMO] Added fake slaves.");
  }
#endif

// HTTP endpoints — identical API surface for Android app


  server.on("/api/register", HTTP_GET, handleRegister);
  server.on("/api/register", HTTP_OPTIONS, handleOptions);
  server.on("/api/slaves", HTTP_GET, handleSlaves);
  server.on("/api/slaves", HTTP_OPTIONS, handleOptions);
  server.on("/api/command", HTTP_POST, handleCommandProxy);
  server.on("/api/command", HTTP_OPTIONS, handleOptions);
  server.on("/api/edit_slave", HTTP_POST, handleEditSlave);
  server.on("/api/edit_slave", HTTP_OPTIONS, handleOptions);
  server.on("/api/delete_slave", HTTP_POST, handleDeleteSlave);
  server.on("/api/delete_slave", HTTP_OPTIONS, handleOptions);
  server.on("/api/reset_registry", HTTP_POST, handleResetRegistry);
  server.on("/api/reset_registry", HTTP_OPTIONS, handleOptions);

  server.on("/api/auth", HTTP_GET, handleCheckAuth);
  server.on("/api/auth", HTTP_OPTIONS, handleOptions);
  server.on("/api/auth/register", HTTP_POST, handleRegisterSA);
  server.on("/api/auth/register", HTTP_OPTIONS, handleOptions);
  server.on("/api/auth/login", HTTP_POST, handleLogin);
  server.on("/api/auth/login", HTTP_OPTIONS, handleOptions);
  server.on("/api/auth/change-pass", HTTP_POST, handleChangePass);
  server.on("/api/auth/change-pass", HTTP_OPTIONS, handleOptions);

  server.on("/api/karyawan", HTTP_GET, handleGetKaryawan);
  server.on("/api/karyawan", HTTP_OPTIONS, handleOptions);
  server.on("/api/karyawan/add", HTTP_POST, handleAddKaryawan);
  server.on("/api/karyawan/add", HTTP_OPTIONS, handleOptions);
  server.on("/api/karyawan/delete", HTTP_POST, handleDeleteKaryawan);
  server.on("/api/karyawan/delete", HTTP_OPTIONS, handleOptions);

  server.on("/api/stats", HTTP_GET, handleGetStats);
  server.on("/api/stats", HTTP_OPTIONS, handleOptions);
  server.on("/api/stats/add", HTTP_POST, handleAddStats);
  server.on("/api/stats/add", HTTP_OPTIONS, handleOptions);
  server.on("/api/stats/reset", HTTP_POST, handleResetStats);
  server.on("/api/stats/reset", HTTP_OPTIONS, handleOptions);

  server.on("/api/transaksi",     HTTP_GET,  handleGetTransaksi);
  server.on("/api/transaksi",     HTTP_OPTIONS, handleOptions);
  server.on("/api/transaksi/add", HTTP_POST, handleAddTransaksi);
  server.on("/api/transaksi/add", HTTP_OPTIONS, handleOptions);

  const char * headerkeys[] = {"X-Admin-User", "X-Admin-Pass"} ;
  size_t headerkeyssize = sizeof(headerkeys)/sizeof(char*);
  server.collectHeaders(headerkeys, headerkeyssize);

  server.on("/", HTTP_GET, []() {
    server.sendHeader("Cache-Control", "no-cache, no-store, must-revalidate");
    server.sendHeader("Pragma", "no-cache");
    server.sendHeader("Expires", "-1");
    server.send(200, "application/json", "{\"status\":\"Excavator Master API Ready\",\"mode\":\"espnow\"}");
  });

  server.onNotFound([]() {
    if (server.method() == HTTP_OPTIONS) {
      server.sendHeader("Access-Control-Allow-Origin", "*");
      server.sendHeader("Access-Control-Max-Age", "10000");
      server.sendHeader("Access-Control-Allow-Methods", "PUT,POST,GET,OPTIONS");
      server.sendHeader("Access-Control-Allow-Headers", "*");
      server.send(204);
    } else {
      server.sendHeader("Location", "http://192.168.4.1/", true);
      server.send(302, "text/plain", "Redirecting...");
    }
  });

  server.begin();
  Serial.println("Web Server running at http://192.168.4.1/");
  Serial.println("[SYSTEM] Master ready! Android connects via Wi-Fi, Slaves via ESP-NOW.");
}

// ===== LOOP =====
void loop() {
  dnsServer.processNextRequest();
  esp_task_wdt_reset();
  server.handleClient();
  updateLed();

  static uint32_t lastLedBlink = 0;
  static uint32_t lastHb = 0;
  uint32_t now = millis();

  if (now - lastLedBlink >= 3000) {
    lastLedBlink = now;
    netLedFlash(50);
  }

  if (now - lastHb >= 1000) {
    lastHb = now;
    if (xSemaphoreTake(slavesMutex, MUTEX_TIMEOUT_TICKS) == pdTRUE) {
      Serial.printf("[MASTER-HB] up=%lus slaves=%d\n", now / 1000, slaveCount);
#if DEMO_MODE
      for (int i = 0; i < slaveCount; i++) {
        bool isFakeOnline = slaves[i].mac.startsWith("FF:FF:FF:00:00:");
        bool isFakeOffline = slaves[i].mac.startsWith("EE:EE:EE:00:00:");
        if (!isFakeOnline && !isFakeOffline) continue;

        if (isFakeOnline) {
          slaves[i].lastSeen = now; // tetap online
        }
        // EE biarkan lastSeen = 0 (tampil offline), tapi timer tetap berjalan

        if (slaves[i].state == "RUNNING" && slaves[i].time_left > 0) {
          slaves[i].time_left--;
          slaves[i].sessionElapsed++;
          if (slaves[i].time_left <= 0) {
            slaves[i].state = "ENDED";
            int slaveId = slaves[i].id;
            int elapsed = slaves[i].sessionElapsed;
            slaves[i].sessionElapsed = 0;
            // Auto-save harus di luar mutex — simpan dulu, rilis mutex lalu save
            xSemaphoreGive(slavesMutex);
            autoSaveStats(slaveId, elapsed, true);
            // Tidak perlu ambil mutex lagi, langsung break dari heartbeat interval
            goto doneHb;
          }
        }
      }
#endif
      xSemaphoreGive(slavesMutex);
    }
    doneHb:;
  }
}